In [1]:
import pandas as pd

In [4]:
print(pd.__version__)

2.0.3

In [5]:
d = {'col_ 1':[1, 2, 3, 4, 5],
     'col_2':[10, 20, 30, 40, 501]}
df = pd. DataFrame(d)
df

   col_ 1  col_2
0       1     10
1       2     20
2       3     30
3       4     40
4       5    501

In [6]:
df.sample(n=4, replace=False, random_state=0)

   col_ 1  col_2
2       3     30
0       1     10
1       2     20
3       4     40

In [7]:
df.sample(n=6, replace=True, random_state=2)

   col_ 1  col_2
0       1     10
0       1     10
3       4     40
2       3     30
3       4     40
0       1     10

In [8]:
df.sample(n=4, replace=True, random_state=0)

   col_ 1  col_2
4       5    501
0       1     10
3       4     40
3       4     40